app/Controllers/Tasks.php

    public function index()
    {
        $taskModel = new TaskModel();

        $tasks = $taskModel
            ->where('task_date', date('Y-m-d'))
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-29'
ORDER BY `created_at` ASC

    public function taskList()
    {
        $taskModel = new TaskModel();

        $tasks = $taskModel
            ->orderBy('task_date', 'ASC')
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `id` ASC

    public function profile()
    {
        $userModel = new UserModel();

        $user = $userModel->first();
---
SELECT *
FROM `users`
 LIMIT 1